MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS804/mcu.h
#define _CLC4CONL_LCOUT_POSITION                 0x00000006
#define _CLC4CONL_LCOUT_MASK                     0x00000040
#define _CLC4CONL_LCOUT_LENGTH                   0x00000001

#define _CLC4CONL_LCOE_POSITION                  0x00000007
#define _CLC4CONL_LCOE_MASK                      0x00000080
#define _CLC4CONL_LCOE_LENGTH                    0x00000001

#define _CLC4CONL_INTN_POSITION                  0x0000000A
#define _CLC4CONL_INTN_MASK                      0x00000400
#define _CLC4CONL_INTN_LENGTH                    0x00000001

#define _CLC4CONL_INTP_POSITION                  0x0000000B
#define _CLC4CONL_INTP_MASK                      0x00000800
#define _CLC4CONL_INTP_LENGTH                    0x00000001

#define _CLC4CONL_LCEN_POSITION                  0x0000000F
#define _CLC4CONL_LCEN_MASK                      0x00008000
#define _CLC4CONL_LCEN_LENGTH                    0x00000001

#define _CLC4CONL_MODE0_POSITION                 0x00000000
#define _CLC4CONL_MODE0_MASK                     0x00000001
#define _CLC4CONL_MODE0_LENGTH                   0x00000001

#define _CLC4CONL_MODE1_POSITION                 0x00000001
#define _CLC4CONL_MODE1_MASK                     0x00000002
#define _CLC4CONL_MODE1_LENGTH                   0x00000001

#define _CLC4CONL_MODE2_POSITION                 0x00000002
#define _CLC4CONL_MODE2_MASK                     0x00000004
#define _CLC4CONL_MODE2_LENGTH                   0x00000001

#define _CLC4CONH_G1POL_POSITION                 0x00000000
#define _CLC4CONH_G1POL_MASK                     0x00000001
#define _CLC4CONH_G1POL_LENGTH                   0x00000001

#define _CLC4CONH_G2POL_POSITION                 0x00000001
#define _CLC4CONH_G2POL_MASK                     0x00000002
#define _CLC4CONH_G2POL_LENGTH                   0x00000001

#define _CLC4CONH_G3POL_POSITION                 0x00000002
#define _CLC4CONH_G3POL_MASK                     0x00000004
#define _CLC4CONH_G3POL_LENGTH                   0x00000001

#define _CLC4CONH_G4POL_POSITION                 0x00000003
#define _CLC4CONH_G4POL_MASK                     0x00000008
#define _CLC4CONH_G4POL_LENGTH                   0x00000001

#define _CLC4SEL_DS1_POSITION                    0x00000000
#define _CLC4SEL_DS1_MASK                        0x00000007
#define _CLC4SEL_DS1_LENGTH                      0x00000003

#define _CLC4SEL_DS2_POSITION                    0x00000004
#define _CLC4SEL_DS2_MASK                        0x00000070
#define _CLC4SEL_DS2_LENGTH                      0x00000003

#define _CLC4SEL_DS3_POSITION                    0x00000008
#define _CLC4SEL_DS3_MASK                        0x00000700
#define _CLC4SEL_DS3_LENGTH                      0x00000003

#define _CLC4SEL_DS4_POSITION                    0x0000000C
#define _CLC4SEL_DS4_MASK                        0x00007000
#define _CLC4SEL_DS4_LENGTH                      0x00000003

#define _CLC4SEL_DS10_POSITION                   0x00000000
#define _CLC4SEL_DS10_MASK                       0x00000001
#define _CLC4SEL_DS10_LENGTH                     0x00000001

#define _CLC4SEL_DS11_POSITION                   0x00000001
#define _CLC4SEL_DS11_MASK                       0x00000002
#define _CLC4SEL_DS11_LENGTH                     0x00000001

#define _CLC4SEL_DS12_POSITION                   0x00000002
#define _CLC4SEL_DS12_MASK                       0x00000004
#define _CLC4SEL_DS12_LENGTH                     0x00000001

#define _CLC4SEL_DS20_POSITION                   0x00000004
#define _CLC4SEL_DS20_MASK                       0x00000010
#define _CLC4SEL_DS20_LENGTH                     0x00000001

#define _CLC4SEL_DS21_POSITION                   0x00000005
#define _CLC4SEL_DS21_MASK                       0x00000020
#define _CLC4SEL_DS21_LENGTH                     0x00000001

#define _CLC4SEL_DS22_POSITION                   0x00000006
#define _CLC4SEL_DS22_MASK                       0x00000040
#define _CLC4SEL_DS22_LENGTH                     0x00000001

#define _CLC4SEL_DS30_POSITION                   0x00000008
#define _CLC4SEL_DS30_MASK                       0x00000100
#define _CLC4SEL_DS30_LENGTH                     0x00000001

#define _CLC4SEL_DS31_POSITION                   0x00000009
#define _CLC4SEL_DS31_MASK                       0x00000200
#define _CLC4SEL_DS31_LENGTH                     0x00000001

#define _CLC4SEL_DS32_POSITION                   0x0000000A
#define _CLC4SEL_DS32_MASK                       0x00000400
#define _CLC4SEL_DS32_LENGTH                     0x00000001

#define _CLC4SEL_DS40_POSITION                   0x0000000C
#define _CLC4SEL_DS40_MASK                       0x00001000
#define _CLC4SEL_DS40_LENGTH                     0x00000001

#define _CLC4SEL_DS41_POSITION                   0x0000000D
#define _CLC4SEL_DS41_MASK                       0x00002000
#define _CLC4SEL_DS41_LENGTH                     0x00000001

#define _CLC4SEL_DS42_POSITION                   0x0000000E
#define _CLC4SEL_DS42_MASK                       0x00004000
#define _CLC4SEL_DS42_LENGTH                     0x00000001

#define _CLC4SELL_DS1_POSITION                   0x00000000
#define _CLC4SELL_DS1_MASK                       0x00000007
#define _CLC4SELL_DS1_LENGTH                     0x00000003

#define _CLC4SELL_DS2_POSITION                   0x00000004
#define _CLC4SELL_DS2_MASK                       0x00000070
#define _CLC4SELL_DS2_LENGTH                     0x00000003

#define _CLC4SELL_DS3_POSITION                   0x00000008
#define _CLC4SELL_DS3_MASK                       0x00000700
#define _CLC4SELL_DS3_LENGTH                     0x00000003

#define _CLC4SELL_DS4_POSITION                   0x0000000C
#define _CLC4SELL_DS4_MASK                       0x00007000
#define _CLC4SELL_DS4_LENGTH                     0x00000003

#define _CLC4SELL_DS10_POSITION                  0x00000000
#define _CLC4SELL_DS10_MASK                      0x00000001
#define _CLC4SELL_DS10_LENGTH                    0x00000001

#define _CLC4SELL_DS11_POSITION                  0x00000001
#define _CLC4SELL_DS11_MASK                      0x00000002
#define _CLC4SELL_DS11_LENGTH                    0x00000001

#define _CLC4SELL_DS12_POSITION                  0x00000002
#define _CLC4SELL_DS12_MASK                      0x00000004
#define _CLC4SELL_DS12_LENGTH                    0x00000001

#define _CLC4SELL_DS20_POSITION                  0x00000004
#define _CLC4SELL_DS20_MASK                      0x00000010
#define _CLC4SELL_DS20_LENGTH                    0x00000001

#define _CLC4SELL_DS21_POSITION                  0x00000005
#define _CLC4SELL_DS21_MASK                      0x00000020
#define _CLC4SELL_DS21_LENGTH                    0x00000001

