MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS804/mcu.h
#define _DMA3REQ_FORCE_POSITION                  0x0000000F
#define _DMA3REQ_FORCE_MASK                      0x00008000
#define _DMA3REQ_FORCE_LENGTH                    0x00000001

#define _DMA3REQ_IRQSEL0_POSITION                0x00000000
#define _DMA3REQ_IRQSEL0_MASK                    0x00000001
#define _DMA3REQ_IRQSEL0_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL1_POSITION                0x00000001
#define _DMA3REQ_IRQSEL1_MASK                    0x00000002
#define _DMA3REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL2_POSITION                0x00000002
#define _DMA3REQ_IRQSEL2_MASK                    0x00000004
#define _DMA3REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL3_POSITION                0x00000003
#define _DMA3REQ_IRQSEL3_MASK                    0x00000008
#define _DMA3REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL4_POSITION                0x00000004
#define _DMA3REQ_IRQSEL4_MASK                    0x00000010
#define _DMA3REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL5_POSITION                0x00000005
#define _DMA3REQ_IRQSEL5_MASK                    0x00000020
#define _DMA3REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL6_POSITION                0x00000006
#define _DMA3REQ_IRQSEL6_MASK                    0x00000040
#define _DMA3REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMA3REQ_IRQSEL7_POSITION                0x00000007
#define _DMA3REQ_IRQSEL7_MASK                    0x00000080
#define _DMA3REQ_IRQSEL7_LENGTH                  0x00000001

#define _DMA3STAH_STA_POSITION                   0x00000000
#define _DMA3STAH_STA_MASK                       0x000000FF
#define _DMA3STAH_STA_LENGTH                     0x00000008

#define _DMA3STBH_STB_POSITION                   0x00000000
#define _DMA3STBH_STB_MASK                       0x000000FF
#define _DMA3STBH_STB_LENGTH                     0x00000008

#define _DMA3CNT_CNT_POSITION                    0x00000000
#define _DMA3CNT_CNT_MASK                        0x00003FFF
#define _DMA3CNT_CNT_LENGTH                      0x0000000E

#define _DMAPWC_PWCOL0_POSITION                  0x00000000
#define _DMAPWC_PWCOL0_MASK                      0x00000001
#define _DMAPWC_PWCOL0_LENGTH                    0x00000001

#define _DMAPWC_PWCOL1_POSITION                  0x00000001
#define _DMAPWC_PWCOL1_MASK                      0x00000002
#define _DMAPWC_PWCOL1_LENGTH                    0x00000001

#define _DMAPWC_PWCOL2_POSITION                  0x00000002
#define _DMAPWC_PWCOL2_MASK                      0x00000004
#define _DMAPWC_PWCOL2_LENGTH                    0x00000001

#define _DMAPWC_PWCOL3_POSITION                  0x00000003
#define _DMAPWC_PWCOL3_MASK                      0x00000008
#define _DMAPWC_PWCOL3_LENGTH                    0x00000001

#define _DMAPWC_PWCOL4_POSITION                  0x00000004
#define _DMAPWC_PWCOL4_MASK                      0x00000010
#define _DMAPWC_PWCOL4_LENGTH                    0x00000001

#define _DMAPWC_PWCOL5_POSITION                  0x00000005
#define _DMAPWC_PWCOL5_MASK                      0x00000020
#define _DMAPWC_PWCOL5_LENGTH                    0x00000001

#define _DMAPWC_PWCOL6_POSITION                  0x00000006
#define _DMAPWC_PWCOL6_MASK                      0x00000040
#define _DMAPWC_PWCOL6_LENGTH                    0x00000001

#define _DMAPWC_PWCOL7_POSITION                  0x00000007
#define _DMAPWC_PWCOL7_MASK                      0x00000080
#define _DMAPWC_PWCOL7_LENGTH                    0x00000001

#define _DMAPWC_PWCOL8_POSITION                  0x00000008
#define _DMAPWC_PWCOL8_MASK                      0x00000100
#define _DMAPWC_PWCOL8_LENGTH                    0x00000001

#define _DMAPWC_PWCOL9_POSITION                  0x00000009
#define _DMAPWC_PWCOL9_MASK                      0x00000200
#define _DMAPWC_PWCOL9_LENGTH                    0x00000001

#define _DMAPWC_PWCOL10_POSITION                 0x0000000A
#define _DMAPWC_PWCOL10_MASK                     0x00000400
#define _DMAPWC_PWCOL10_LENGTH                   0x00000001

#define _DMAPWC_PWCOL11_POSITION                 0x0000000B
#define _DMAPWC_PWCOL11_MASK                     0x00000800
#define _DMAPWC_PWCOL11_LENGTH                   0x00000001

#define _DMAPWC_PWCOL12_POSITION                 0x0000000C
#define _DMAPWC_PWCOL12_MASK                     0x00001000
#define _DMAPWC_PWCOL12_LENGTH                   0x00000001

#define _DMAPWC_PWCOL13_POSITION                 0x0000000D
#define _DMAPWC_PWCOL13_MASK                     0x00002000
#define _DMAPWC_PWCOL13_LENGTH                   0x00000001

#define _DMAPWC_PWCOL14_POSITION                 0x0000000E
#define _DMAPWC_PWCOL14_MASK                     0x00004000
#define _DMAPWC_PWCOL14_LENGTH                   0x00000001

#define _DMARQC_RQCOL0_POSITION                  0x00000000
#define _DMARQC_RQCOL0_MASK                      0x00000001
#define _DMARQC_RQCOL0_LENGTH                    0x00000001

#define _DMARQC_RQCOL1_POSITION                  0x00000001
#define _DMARQC_RQCOL1_MASK                      0x00000002
#define _DMARQC_RQCOL1_LENGTH                    0x00000001

#define _DMARQC_RQCOL2_POSITION                  0x00000002
#define _DMARQC_RQCOL2_MASK                      0x00000004
#define _DMARQC_RQCOL2_LENGTH                    0x00000001

#define _DMARQC_RQCOL3_POSITION                  0x00000003
#define _DMARQC_RQCOL3_MASK                      0x00000008
#define _DMARQC_RQCOL3_LENGTH                    0x00000001

#define _DMARQC_RQCOL4_POSITION                  0x00000004
#define _DMARQC_RQCOL4_MASK                      0x00000010
#define _DMARQC_RQCOL4_LENGTH                    0x00000001

#define _DMARQC_RQCOL5_POSITION                  0x00000005
#define _DMARQC_RQCOL5_MASK                      0x00000020
#define _DMARQC_RQCOL5_LENGTH                    0x00000001

#define _DMARQC_RQCOL6_POSITION                  0x00000006
#define _DMARQC_RQCOL6_MASK                      0x00000040
#define _DMARQC_RQCOL6_LENGTH                    0x00000001

#define _DMARQC_RQCOL7_POSITION                  0x00000007
#define _DMARQC_RQCOL7_MASK                      0x00000080
#define _DMARQC_RQCOL7_LENGTH                    0x00000001

#define _DMARQC_RQCOL8_POSITION                  0x00000008
#define _DMARQC_RQCOL8_MASK                      0x00000100
#define _DMARQC_RQCOL8_LENGTH                    0x00000001

#define _DMARQC_RQCOL9_POSITION                  0x00000009
#define _DMARQC_RQCOL9_MASK                      0x00000200
#define _DMARQC_RQCOL9_LENGTH                    0x00000001

