MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS804/mcu.h
#define _PWMCAP8_PWMCAP9_POSITION                0x0000000C
#define _PWMCAP8_PWMCAP9_MASK                    0x00001000
#define _PWMCAP8_PWMCAP9_LENGTH                  0x00000001

#define _PWMCAP8_PWMCAP10_POSITION               0x0000000D
#define _PWMCAP8_PWMCAP10_MASK                   0x00002000
#define _PWMCAP8_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP8_PWMCAP11_POSITION               0x0000000E
#define _PWMCAP8_PWMCAP11_MASK                   0x00004000
#define _PWMCAP8_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP8_PWMCAP12_POSITION               0x0000000F
#define _PWMCAP8_PWMCAP12_MASK                   0x00008000
#define _PWMCAP8_PWMCAP12_LENGTH                 0x00000001

#define _LEBCON8_BPLL_POSITION                   0x00000000
#define _LEBCON8_BPLL_MASK                       0x00000001
#define _LEBCON8_BPLL_LENGTH                     0x00000001

#define _LEBCON8_BPLH_POSITION                   0x00000001
#define _LEBCON8_BPLH_MASK                       0x00000002
#define _LEBCON8_BPLH_LENGTH                     0x00000001

#define _LEBCON8_BPHL_POSITION                   0x00000002
#define _LEBCON8_BPHL_MASK                       0x00000004
#define _LEBCON8_BPHL_LENGTH                     0x00000001

#define _LEBCON8_BPHH_POSITION                   0x00000003
#define _LEBCON8_BPHH_MASK                       0x00000008
#define _LEBCON8_BPHH_LENGTH                     0x00000001

#define _LEBCON8_BCL_POSITION                    0x00000004
#define _LEBCON8_BCL_MASK                        0x00000010
#define _LEBCON8_BCL_LENGTH                      0x00000001

#define _LEBCON8_BCH_POSITION                    0x00000005
#define _LEBCON8_BCH_MASK                        0x00000020
#define _LEBCON8_BCH_LENGTH                      0x00000001

#define _LEBCON8_CLLEBEN_POSITION                0x0000000A
#define _LEBCON8_CLLEBEN_MASK                    0x00000400
#define _LEBCON8_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON8_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON8_FLTLEBEN_MASK                   0x00000800
#define _LEBCON8_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON8_PLF_POSITION                    0x0000000C
#define _LEBCON8_PLF_MASK                        0x00001000
#define _LEBCON8_PLF_LENGTH                      0x00000001

#define _LEBCON8_PLR_POSITION                    0x0000000D
#define _LEBCON8_PLR_MASK                        0x00002000
#define _LEBCON8_PLR_LENGTH                      0x00000001

#define _LEBCON8_PHF_POSITION                    0x0000000E
#define _LEBCON8_PHF_MASK                        0x00004000
#define _LEBCON8_PHF_LENGTH                      0x00000001

#define _LEBCON8_PHR_POSITION                    0x0000000F
#define _LEBCON8_PHR_MASK                        0x00008000
#define _LEBCON8_PHR_LENGTH                      0x00000001

#define _LEBDLY8_LEB_POSITION                    0x00000003
#define _LEBDLY8_LEB_MASK                        0x00000FF8
#define _LEBDLY8_LEB_LENGTH                      0x00000009

#define _LEBDLY8_LEB0_POSITION                   0x00000003
#define _LEBDLY8_LEB0_MASK                       0x00000008
#define _LEBDLY8_LEB0_LENGTH                     0x00000001

#define _LEBDLY8_LEB1_POSITION                   0x00000004
#define _LEBDLY8_LEB1_MASK                       0x00000010
#define _LEBDLY8_LEB1_LENGTH                     0x00000001

#define _LEBDLY8_LEB2_POSITION                   0x00000005
#define _LEBDLY8_LEB2_MASK                       0x00000020
#define _LEBDLY8_LEB2_LENGTH                     0x00000001

#define _LEBDLY8_LEB3_POSITION                   0x00000006
#define _LEBDLY8_LEB3_MASK                       0x00000040
#define _LEBDLY8_LEB3_LENGTH                     0x00000001

#define _LEBDLY8_LEB4_POSITION                   0x00000007
#define _LEBDLY8_LEB4_MASK                       0x00000080
#define _LEBDLY8_LEB4_LENGTH                     0x00000001

#define _LEBDLY8_LEB5_POSITION                   0x00000008
#define _LEBDLY8_LEB5_MASK                       0x00000100
#define _LEBDLY8_LEB5_LENGTH                     0x00000001

#define _LEBDLY8_LEB6_POSITION                   0x00000009
#define _LEBDLY8_LEB6_MASK                       0x00000200
#define _LEBDLY8_LEB6_LENGTH                     0x00000001

#define _LEBDLY8_LEB7_POSITION                   0x0000000A
#define _LEBDLY8_LEB7_MASK                       0x00000400
#define _LEBDLY8_LEB7_LENGTH                     0x00000001

#define _LEBDLY8_LEB8_POSITION                   0x0000000B
#define _LEBDLY8_LEB8_MASK                       0x00000800
#define _LEBDLY8_LEB8_LENGTH                     0x00000001

#define _AUXCON8_CHOPLEN_POSITION                0x00000000
#define _AUXCON8_CHOPLEN_MASK                    0x00000001
#define _AUXCON8_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPHEN_POSITION                0x00000001
#define _AUXCON8_CHOPHEN_MASK                    0x00000002
#define _AUXCON8_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPSEL_POSITION                0x00000002
#define _AUXCON8_CHOPSEL_MASK                    0x0000003C
#define _AUXCON8_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON8_BLANKSEL_POSITION               0x00000008
#define _AUXCON8_BLANKSEL_MASK                   0x00000F00
#define _AUXCON8_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON8_HRDDIS_POSITION                 0x0000000E
#define _AUXCON8_HRDDIS_MASK                     0x00004000
#define _AUXCON8_HRDDIS_LENGTH                   0x00000001

#define _AUXCON8_HRPDIS_POSITION                 0x0000000F
#define _AUXCON8_HRPDIS_MASK                     0x00008000
#define _AUXCON8_HRPDIS_LENGTH                   0x00000001

#define _AUXCON8_CHOPSEL0_POSITION               0x00000002
#define _AUXCON8_CHOPSEL0_MASK                   0x00000004
#define _AUXCON8_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL1_POSITION               0x00000003
#define _AUXCON8_CHOPSEL1_MASK                   0x00000008
#define _AUXCON8_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL2_POSITION               0x00000004
#define _AUXCON8_CHOPSEL2_MASK                   0x00000010
#define _AUXCON8_CHOPSEL2_LENGTH                 0x00000001

