MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS804/mcu.h
/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __PGA1CAL_BASE 0x800e48
#define __PGA1CAL_LENGTH 0x2

#define __PGA2CAL_BASE 0x800e4c
#define __PGA2CAL_LENGTH 0x2

#define __ISRCCAL_BASE 0x800e78
#define __ISRCCAL_LENGTH 0x2

#define __FBOOT_BASE 0x801000
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xad80

#define __FSEC_BASE 0xaf80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xaf90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xaf94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xaf98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xaf9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xafa0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xafa4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xafa8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0xafac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0xafb0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0xaffc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x5580

#define __FSEC_BASE 0x5780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x5790
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x5794
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x5798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x57a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x57a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x57a8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0x57ac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x57b0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0x57fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1 6
#define _RPOUT_SS1 7
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2 9
#define _RPOUT_SS2 10
#define _RPOUT_C1TX 14
#define _RPOUT_C2TX 15
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_ACMP1 24
#define _RPOUT_ACMP2 25
#define _RPOUT_ACMP3 26
#define _RPOUT_SDO3 31
#define _RPOUT_SCK3 32
#define _RPOUT_SS3 33
#define _RPOUT_SYNCO1 45
#define _RPOUT_SYNCO2 46
#define _RPOUT_REFCLKO 49
#define _RPOUT_ACMP4 50
#define _RPOUT_PWM4H 51
#define _RPOUT_PWM4L 52
#define _RPOUT_PWM5H 53
#define _RPOUT_PWM5L 54
#define _RPOUT_PWM6H 57
#define _RPOUT_PWM6L 58
#define _RPOUT_PWM7H 59
#define _RPOUT_PWM7L 60
#define _RPOUT_PWM8H 61
#define _RPOUT_PWM8L 62
#define _RPOUT_CLC1OUT 63
#define _RPOUT_CLC2OUT 64
#define _RPOUT_CLC3OUT 65
#define _RPOUT_CLC4OUT 66

#endif
